In [9]:
import numpy as np
import pandas as pd
info= {
       'ID':['r200260','r200247','r200057','r200058','r200847'],
       'Name':['Pavan','Nithin','Prasad','Srujan','Arman'],
       'Marks':[28,29,30,35,24],
       'Phone':[7036006588,np.nan,8500050716,7416485585,np.nan],
       'Address':[np.nan,'Nuzvidu',np.nan,'IDUPULAPAAYA','Nellore']
       }
df=pd.DataFrame(info)
print(df)

        ID    Name  Marks         Phone       Address
0  r200260   Pavan     28  7.036007e+09           NaN
1  r200247  Nithin     29           NaN       Nuzvidu
2  r200057  Prasad     30  8.500051e+09           NaN
3  r200058  Srujan     35  7.416486e+09  IDUPULAPAAYA
4  r200847   Arman     24           NaN       Nellore

In [2]:
df.isnull()

      ID   Name  Marks  Phone  Address
0  False  False  False  False     True
1  False  False  False   True    False
2  False  False  False  False     True
3  False  False  False  False    False
4  False  False  False   True    False

In [3]:
df.isnull().any()

ID         False
Name       False
Marks      False
Phone       True
Address     True
dtype: bool

In [4]:
df['Phone'].isnull()

0    False
1     True
2    False
3    False
4     True
Name: Phone, dtype: bool

In [10]:
df.dropna()

        ID    Name  Marks         Phone       Address
3  r200058  Srujan     35  7.416486e+09  IDUPULAPAAYA

In [7]:
df.fillna('Dont Know')

        ID    Name  Marks         Phone       Address
0  r200260   Pavan     28  7036006588.0     Dont Know
1  r200247  Nithin     29     Dont Know       Nuzvidu
2  r200057  Prasad     30  8500050716.0     Dont Know
3  r200058  Srujan     35  7416485585.0  IDUPULAPAAYA
4  r200847   Arman     24     Dont Know       Nellore

In [8]:
df.ffill()

        ID    Name  Marks         Phone       Address
0  r200260   Pavan     28  7.036007e+09           NaN
1  r200247  Nithin     29  7.036007e+09       Nuzvidu
2  r200057  Prasad     30  8.500051e+09       Nuzvidu
3  r200058  Srujan     35  7.416486e+09  IDUPULAPAAYA
4  r200847   Arman     24  7.416486e+09       Nellore

In [11]:
n=int(input("enter the no. of peoples income do u want to enter:"))
l=[]
for i in range(n):
    income=int(input(f"enter the income {i+1}:"))
    l.append(income)
print(l)
bins=[0,10000,25000,50000,100000]
bin_names=['Basic Salary','Minimum Salary','Required Salary','Max Salary']
b=pd.cut(l,bins,labels=bin_names)
b

enter the no. of peoples income do u want to enter: 4
enter the income 1: 12000
enter the income 2: 120000
enter the income 3: 87000
enter the income 4: 90000

[12000, 120000, 87000, 90000]

['Minimum Salary', NaN, 'Max Salary', 'Max Salary']
Categories (4, object): ['Basic Salary' < 'Minimum Salary' < 'Required Salary' < 'Max Salary']

In [12]:
n=int(input("enter the no. of peoples age do u want to enter:"))
l1=[]
for i in range(n):
    age=int(input(f"enter the age of person {i+1}:"))
    l1.append(age)
print(l1)
bins=[0,13,19,27,60,100]
bin_names=['Child age','Teenage','Adult age','middle age','old age']
b=pd.cut(l1,bins,labels=bin_names)
b

enter the no. of peoples age do u want to enter: 4
enter the age of person 1: 12
enter the age of person 2: 34
enter the age of person 3: 78
enter the age of person 4: 65

[12, 34, 78, 65]

['Child age', 'middle age', 'old age', 'old age']
Categories (5, object): ['Child age' < 'Teenage' < 'Adult age' < 'middle age' < 'old age']